Рабочая.Задачи2/src/InformationRegisters/ЦБР_СостоянияЗаданий/ЦБР_СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СостоянияЗаданий</name>
  <resources>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательАРМ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/CommonForms/ЦБР_ФормаСогласования/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предмет", Предмет) Тогда
		
		СогласованиеСроков = Ложь;
		СогласованиеОценки = Истина;
		
		Если Параметры.Свойство("КонтролироватьСроки") Тогда
			КонтролироватьСроки = Параметры.КонтролироватьСроки;
		Иначе	 
			КонтролироватьСроки = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Предмет, "КонтролироватьСроки");
		КонецЕсли;
		
		ЗаполнитьТаблицуСогласованияЗаданий();
		
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Согласовать(Команда)
	
	СогласоватьНаСервере();    
	Оповестить("Задача_Согласование");

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьНаСервере();
	Оповестить("Задача_Согласование");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СогласоватьНаСервере()	

	Получатели        = Новый Массив;
	СогласованыеЭтапы = Новый Массив;
	
	Для Каждого Стр Из СогласованиеЗаданий Цикл
		
		Если Не Стр.ВыбранноеЗначение Тогда
			Продолжить;
		КонецЕсли;

		Этап = Стр.СсылкаНаСтроку.ПолучитьОбъект();
		
		Если СогласованиеОценки Тогда
			Этап.ОценкаСогласована = Истина;
			//Этап.Состояние = Перечисления.ЦБР_Состояние.ОценкаСогласована;
			//Этап.ОтправленаНаСогласованиеОценки = Ложь;
			//Если Не КонтролироватьСроки Тогда
			//	Этап.СрокиСогласованы = Истина;
			//	Этап.Состояние = Перечисления.ЦБР_Состояние.Согласован;
			//КонецЕсли;
		КонецЕсли;

		//Если СогласованиеСроков Тогда
		//	Этап.СрокиСогласованы = Истина;
		//	Этап.ОтправленаНаСогласованиеСроков = Ложь;
		//КонецЕсли;

		Этап.Записать();
		
		ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(Этап.Ссылка, Перечисления.ЦБР_Состояние.Согласован);
		
		//Если Этап.Состояние = Перечисления.ЦБР_Состояние.Согласован Тогда
			Получатели.Добавить(Этап.Исполнитель);
			СогласованыеЭтапы.Добавить(Этап.Наименование);
			ЦБР_ЗадачиЗаданияВызовСервера.СоздатьНовоеЗадание(Этап.Ссылка);
		//КонецЕсли;
	КонецЦикла;
	
	Если Получатели.Количество() Тогда 
		ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(Получатели);
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Этап.Владелец,"СогласоватьОценку", Получатели, СогласованыеЭтапы);
	КонецЕсли;

	ЗаполнитьТаблицуСогласованияЗаданий();
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	
	Ошибка           = Неопределено;
	ОтклоненныеЭтапы = Новый Массив;
	Получатели       = Новый Массив;

	Для Каждого Стр Из СогласованиеЗаданий Цикл

		Если Не Стр.ВыбранноеЗначение Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Стр.Комментарий) Тогда

			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибка, "СогласованиеЗаданий[%1].Коментарий", НСтр(
				"ru = 'Не указана причина отказа.'"), "СогласованиеЗаданий", Стр.НомерЗаданияВУровне, НСтр(
		"ru = 'Для задания с номером %1 не указана причина отказа.'"));
			Продолжить;
		КонецЕсли;

		Этап = Стр.СсылкаНаСтроку.ПолучитьОбъект();
		ОтклоненныеЭтапы.Добавить("" + Стр.Наименование + ": " + Стр.Комментарий + "");
		Получатели.Добавить(Этап.Исполнитель);
		
		//Если СогласованиеОценки Тогда
		//	Этап.Состояние = Перечисления.ЦБР_Состояние.ОценкаНеСогласована;
		//	Этап.ОтправленаНаСогласованиеОценки = Ложь;
		//Иначе
		//	Этап.ОтправленаНаСогласованиеСроков = Ложь;
		//	Этап.Состояние = Перечисления.ЦБР_Состояние.СрокиНеСогласованы;
		//КонецЕсли;

		Этап.Записать();
		
		ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(Этап.Ссылка, Перечисления.ЦБР_Состояние.НеСогласован);
	КонецЦикла;
	
	Если ОтклоненныеЭтапы.Количество() Тогда 
		ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(Получатели);	
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Предмет, "Отклонить"+?(СогласованиеОценки,"Оценку","Сроки"), Получатели, ОтклоненныеЭтапы);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибка);
	
	ЗаполнитьТаблицуСогласованияЗаданий(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСогласованияЗаданий()

	СогласованиеЗаданий.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦБР_СостоянияЗаданий.Задание КАК Задание,
	|	ЦБР_СостоянияЗаданий.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_Состояние
	|ИЗ
	|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
	|ГДЕ
	|	ЦБР_СостоянияЗаданий.Состояние = &Состояние
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_СостоянияЗаданий.Задание,
	|	ЦБР_СостоянияЗаданий.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_СтруктураЗадач.Ссылка КАК СсылкаНаСтроку,
	|	ЦБР_СтруктураЗадач.ВидЧаса КАК ВидЧаса,
	|	ЦБР_СтруктураЗадач.ВремяНачалаПлан КАК ВремяНачалаПлан,
	|	ЦБР_СтруктураЗадач.ВремяОкончанияПлан КАК ВремяОкончанияПлан,
	|	ЦБР_СтруктураЗадач.ДатаНачалоПлан КАК ДатаНачалоПлан,
	|	ЦБР_СтруктураЗадач.ДатаОкончаниеПлан КАК ДатаОкончаниеПлан,
	|	ЦБР_СтруктураЗадач.Наименование КАК Наименование,
	|	ЦБР_СтруктураЗадач.НетГарантии КАК НетГарантии,
	|	ЦБР_СтруктураЗадач.ТрудозатратыПлан КАК ТрудозатратыПлан,
	|	ЦБР_СтруктураЗадач.ТрудозатратыПланКомментарий КАК ТрудозатратыПланКомментарий,
	|	ЦБР_СтруктураЗадач.ТрудозатратыПланПредставление КАК ТрудозатратыПланПредставление,
	|	ЦБР_СтруктураЗадач.НомерЗаданияВУровне КАК НомерЗаданияВУровне
	|ИЗ
	|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
	|ГДЕ
	|	ЦБР_СтруктураЗадач.Владелец = &СсылкаНаЗадачу
	//|	И &Согласование
	|	И ЦБР_СтруктураЗадач.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Состояние.Задание
	|			ИЗ
	|				ВТ_Состояние КАК ВТ_Состояние)";

	//Если СогласованиеОценки Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Согласование",
	//		"ЦБР_СтруктураЗадач.ОтправленаНаСогласованиеОценки = Истина");
	//ИначеЕсли СогласованиеСроков Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Согласование",
	//		"ЦБР_СтруктураЗадач.ОтправленаНаСогласованиеСроков = Истина");
	//КонецЕсли;

	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Предмет);
	Запрос.УстановитьПараметр("Состояние", Перечисления.ЦБР_Состояние.НаСогласовании);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = СогласованиеЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
